a1, b1, c1 = map(int, input("Введите коэффициенты первой прямой (через пробел) -> ").split())
a2, b2, c2 = map(int, input("Введите коэффициенты второй прямой (через пробел) -> ").split())
k = 0
if a1 == 0 and b1 == 0:
    k += 1
if a2 == 0 and b2 == 0:
    k += 1
if k == 1:
    print("Одна из прямых не существует")
elif k == 2:
    print("Обе прямые не существуют")
elif a1 == a2 and b1 == b2 and c1 == c2:
    print("Прямые совпадают")
elif a1 * b2 - b1 * a2 == 0:
    print("Прямые параллельны")
else:
    x = (b1 * c2 - b2 * c1) / (a1 * b2 - b1 * a2)
    y = (a2 * c1 - a2 * c2) / (a1 * b2 - b1 * a2)
    print("Координаты точки пересечения: ")
    print("x = ", x, "y = ", y)
exit(1)
